experiments/barrett-reduce/T03-quotient-partition/mutation-hardening/BR_AF4_06_T3_MUTATION_HARDENING_RUN1/mutant_sources/M3_false_endpoint.diff
--- /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_05_T3_QUOTIENT_PARTITION_RUN1/br_af4_t3_quotient_partition_harness.c	2026-07-22 01:55:55.420421180 +0300
+++ /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_06_T3_MUTATION_HARDENING_RUN1/mutant_sources/br_af4_t3_false_endpoint_harness.c	2026-07-22 02:11:22.212194296 +0300
@@ -114,7 +114,7 @@
   __CPROVER_assert(
       (
         (formula_quotient == -10) ==
-        ((int32_t)a <= -31626)
+        ((int32_t)a <= -31625)
       ) &&
       (
         (formula_quotient == 10) ==
