experiments/barrett-reduce/T04-unique-multiplier/mutation-hardening/BR_AF4_09_T4_MUTATION_HARDENING_RUN1/mutant_harnesses/M1_false_unique_20158.diff
--- /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_08_T4_UNIQUE_MULTIPLIER_RUN1/br_af4_t4_unique_multiplier_harness.c	2026-07-22 02:21:57.993386655 +0300
+++ /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_09_T4_MUTATION_HARDENING_RUN1/mutant_harnesses/br_af4_t4_false_unique_20158_harness.c	2026-07-22 02:26:28.966766273 +0300
@@ -144,7 +144,7 @@
           upper_witness_candidate ==
             upper_witness_expected
         ) ==
-        (multiplier == 20159)
+        (multiplier == 20158)
       ),
       "BR-AF4-T4.P18 two-witness uniqueness of multiplier 20159");
 }
