experiments/barrett-reduce/T04-unique-multiplier/mutation-hardening/BR_AF4_09_T4_MUTATION_HARDENING_RUN1/mutant_harnesses/M3_false_upper_witness.diff
--- /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_08_T4_UNIQUE_MULTIPLIER_RUN1/br_af4_t4_unique_multiplier_harness.c	2026-07-22 02:21:57.993386655 +0300
+++ /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_09_T4_MUTATION_HARDENING_RUN1/mutant_harnesses/br_af4_t4_false_upper_witness_harness.c	2026-07-22 02:26:29.017661635 +0300
@@ -91,7 +91,7 @@
   int64_t upper_witness_candidate =
       br_af4_candidate_result(
           multiplier,
-          (int16_t)-31625);
+          (int16_t)-31626);
 
   int64_t lower_witness_expected =
       br_af4_centered_oracle(
@@ -99,7 +99,7 @@
 
   int64_t upper_witness_expected =
       br_af4_centered_oracle(
-          (int16_t)-31625);
+          (int16_t)-31626);
 
   /*
    * The cast and int32 shift are reached only after the representability
