experiments/barrett-reduce/T05-offset-interval/mutation-hardening/BR_AF4_11_T5_MUTATION_HARDENING_RUN1/mutant_harnesses/M1_false_lower_endpoint.diff
--- /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_10_T5_OFFSET_INTERVAL_RUN1/br_af4_t5_offset_interval_harness.c	2026-07-22 02:34:00.766860892 +0300
+++ /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_11_T5_MUTATION_HARDENING_RUN1/mutant_harnesses/br_af4_t5_false_lower_endpoint_harness.c	2026-07-22 02:39:20.977463422 +0300
@@ -136,7 +136,8 @@
       "BR-AF4-T5.P19 complete offset-domain numerator safety");
 
   __CPROVER_assert(
-      !offset_is_admissible ||
+      !(offset >= 33548598 &&
+        offset <= 33560264) ||
       candidate == (int64_t)centered,
       "BR-AF4-T5.P20 admissible interval full-domain sufficiency");
 
