experiments/barrett-reduce/T05-offset-interval/mutation-hardening/BR_AF4_11_T5_MUTATION_HARDENING_RUN1/mutant_harnesses/M3_false_unique_offset.diff
--- /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_10_T5_OFFSET_INTERVAL_RUN1/br_af4_t5_offset_interval_harness.c	2026-07-22 02:34:00.766860892 +0300
+++ /home/girish/THESIS-2026/mlk_barrett_reduce_cleanroom/BR_AF4_11_T5_MUTATION_HARDENING_RUN1/mutant_harnesses/br_af4_t5_false_unique_offset_harness.c	2026-07-22 02:39:21.029031927 +0300
@@ -161,7 +161,7 @@
           upper_witness_candidate ==
             upper_witness_expected
         ) ==
-        offset_is_admissible
+        (offset == 33554432)
       ),
       "BR-AF4-T5.P23 exact two-witness interval characterization");
 
