experiments/poly-frombytes/PFB-T2-bit-routing-and-block-locality/01-final-mutation-and-control-run/PFB_02M_T2_FINAL_MUTATION_RUN_20260729T050106Z/mutants/p1_first_byte_route/source.diff
diff --git a/mlkem/src/compress.c b/mlkem/src/compress.c
index 874ea1ef..2f60c480 100644
--- a/mlkem/src/compress.c
+++ b/mlkem/src/compress.c
@@ -646,7 +646,7 @@ __contract__(
      *   not signed-overflow even on a 16-bit system.
      * - The cast to int16_t is safe due to the explicit 0xFFF truncation.
      */
-    r->coeffs[2 * i + 0] = (int16_t)(t0 | (((uint16_t)t1 << 8) & 0xFFF));
+    r->coeffs[2 * i + 0] = (int16_t)((t0 >> 1) | (((uint16_t)t1 << 8) & 0xFFF));
     r->coeffs[2 * i + 1] = (int16_t)((t1 >> 4) | (t2 << 4));
   }
 
