experiments/poly-frombytes/PFB-T2-bit-routing-and-block-locality/01-final-mutation-and-control-run/PFB_02M_T2_FINAL_MUTATION_RUN_20260729T050106Z/mutants/p3_high_nibble_route/source.diff
diff --git a/mlkem/src/compress.c b/mlkem/src/compress.c
index 874ea1ef..6160521c 100644
--- a/mlkem/src/compress.c
+++ b/mlkem/src/compress.c
@@ -647,7 +647,7 @@ __contract__(
      * - The cast to int16_t is safe due to the explicit 0xFFF truncation.
      */
     r->coeffs[2 * i + 0] = (int16_t)(t0 | (((uint16_t)t1 << 8) & 0xFFF));
-    r->coeffs[2 * i + 1] = (int16_t)((t1 >> 4) | (t2 << 4));
+    r->coeffs[2 * i + 1] = (int16_t)((t1 >> 5) | (t2 << 4));
   }
 
   /* Note that the coefficients are not canonical */
