experiments/poly-frombytes/PFB-T3-differential-conservation/00-authoritative-proof-controls-and-mutations/PFB_03F_T3_FINAL_RUN_20260729T051133Z/mutants/p1_bijective_permutation/source.diff
diff --git a/mlkem/src/compress.c b/mlkem/src/compress.c
index 874ea1ef..83b3f923 100644
--- a/mlkem/src/compress.c
+++ b/mlkem/src/compress.c
@@ -646,7 +646,7 @@ __contract__(
      *   not signed-overflow even on a 16-bit system.
      * - The cast to int16_t is safe due to the explicit 0xFFF truncation.
      */
-    r->coeffs[2 * i + 0] = (int16_t)(t0 | (((uint16_t)t1 << 8) & 0xFFF));
+    r->coeffs[2 * i + 0] = (int16_t)((((((uint16_t)t0 << 1) | ((uint16_t)t0 >> 7)) & 0xFF) | (((uint16_t)t1 << 8) & 0xFFF)));
     r->coeffs[2 * i + 1] = (int16_t)((t1 >> 4) | (t2 << 4));
   }
 
