experiments/poly-sub/T01-exact-semantics/extended-hardening/04_mutation_reduce/source/m4_single_site_mutation.diff
--- poly_frozen_baseline.c
+++ poly_m4_skip_final_reduce.c
@@ -190,9 +190,9 @@
 )
 {
   unsigned i;
 
-  for (i = 0; i < MLKEM_N; i++)
+  for (i = 0; i < (MLKEM_N - 1); i++)
   __loop__(
     invariant(i <= MLKEM_N)
     invariant(array_bound(r->coeffs, 0, i, 0, MLKEM_Q))
     decreases(MLKEM_N - i))
