experiments/scalar-signed-to-unsigned-q/T01-exact-fibres-and-equivalence-classes/final-evidence/02_mutants/M3_reversed_selection/poly_source.diff
--- baseline/mlkem/src/poly.c
+++ M3_reversed_selection/mlkem/src/poly.c
@@ -169,7 +169,7 @@
    *
    * Note that c + MLKEM_Q does not overflow in int16_t,
    * so the cast to uint16_t is safe. */
-  c = mlk_ct_sel_int16((int16_t)(c + MLKEM_Q), c, mlk_ct_cmask_neg_i16(c));
+  c = mlk_ct_sel_int16(c, (int16_t)(c + MLKEM_Q), mlk_ct_cmask_neg_i16(c)); /* CANON mutant M3: reverse selector operands */
 
   mlk_assert_bound(&c, 1, 0, MLKEM_Q);
   return c;
