experiments/scalar-signed-to-unsigned-q/T02-retraction-and-normalization-stability/final-evidence/02_mutants/M2_swap_zero_one/poly_source.diff
--- baseline/mlkem/src/poly.c
+++ M2_swap_zero_one/mlkem/src/poly.c
@@ -169,7 +169,7 @@
    *
    * Note that c + MLKEM_Q does not overflow in int16_t,
    * so the cast to uint16_t is safe. */
-  c = mlk_ct_sel_int16((int16_t)(c + MLKEM_Q), c, mlk_ct_cmask_neg_i16(c));
+  c = (c == 0) ? 1 : ((c == 1) ? 0 : mlk_ct_sel_int16((int16_t)(c + MLKEM_Q), c, mlk_ct_cmask_neg_i16(c))); /* CANON-T2 mutant M2: swap canonical zero and one */
 
   mlk_assert_bound(&c, 1, 0, MLKEM_Q);
   return c;
