experiments/scalar-signed-to-unsigned-q/T03-modular-arithmetic-compatibility/final-evidence/02_mutants/M1_identity/poly_source.diff
--- baseline/mlkem/src/poly.c
+++ M1_identity/mlkem/src/poly.c
@@ -169,7 +169,7 @@
    *
    * Note that c + MLKEM_Q does not overflow in int16_t,
    * so the cast to uint16_t is safe. */
-  c = mlk_ct_sel_int16((int16_t)(c + MLKEM_Q), c, mlk_ct_cmask_neg_i16(c));
+  c = c; /* CANON-T3 mutant M1: identity normalization */
 
   mlk_assert_bound(&c, 1, 0, MLKEM_Q);
   return c;
