experiments/zeroize/V01-mutation-sensitivity/raw-run/M2_fill_with_one/mutant.diff
--- /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M2_fill_with_one/reference.c	2026-07-28 08:35:35.006832890 +0300
+++ /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M2_fill_with_one/mutant.c	2026-07-28 08:35:35.008831890 +0300
@@ -6,9 +6,12 @@
   uint8_t *bytes = (uint8_t *)ptr;
   size_t i;
 
+  /*
+   * M2: use the wrong fill value.
+   */
   for (i = 0u; i < len; i++)
   {
-    bytes[i] = 0u;
+    bytes[i] = 1u;
   }
 }
 
