experiments/zeroize/V01-mutation-sensitivity/raw-run/M4_pointer_plus_one/mutant.diff
--- /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M4_pointer_plus_one/reference.c	2026-07-28 08:35:35.016827889 +0300
+++ /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M4_pointer_plus_one/mutant.c	2026-07-28 08:35:35.019031243 +0300
@@ -6,7 +6,10 @@
   uint8_t *bytes = (uint8_t *)ptr;
   size_t i;
 
-  for (i = 0u; i < len; i++)
+  /*
+   * M4: begin wiping one byte after the requested start.
+   */
+  for (i = 1u; i < len; i++)
   {
     bytes[i] = 0u;
   }
