experiments/zeroize/V01-mutation-sensitivity/raw-run/M8_omit_second_partition/mutant.diff
--- /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M8_omit_second_partition/reference.c	2026-07-28 08:35:35.036817889 +0300
+++ /home/girish/THESIS-2026/mlk_zeroize_cleanroom/ZERO-V1_RUN1_af4c5abd/M8_omit_second_partition/mutant.c	2026-07-28 08:35:35.038816889 +0300
@@ -18,8 +18,11 @@
     size_t length_1,
     size_t length_2)
 {
+  /*
+   * M8: perform only the first adjacent partition.
+   */
   zero_v1_wipe_M8(&buffer[offset], length_1);
-  zero_v1_wipe_M8(&buffer[offset + length_1], length_2);
+  (void)length_2;
 }
 
 void harness(void)
